using System;
using System.Collections.Generic;

namespace FiscalServiceMenu
{
    public class Enumerations
    {
        #region Список ответов
        public static Dictionary<UInt32, string> ANS =
                   new Dictionary<UInt32, string>()
                   {
                       {0x00, "Загальний статус РРО" },
                       {0x01, "Розширений статус РРО" },
                       {0x02, "Пакет даних від РРО" },
                       {0x03, "Дані відсутні" },
                       {0x04, "РРО опрацьовує команду, потрібно більше часу" }
                   };
        #endregion

        #region Список команд
        public static Dictionary<int, string> Commands =
                   new Dictionary<int, string>()
                   {
                       {23, "RegUser" },
                       {14, "RenameUser" },
                       {8,  "BeginReceipt" },
                       {26, "CPROD" },
                       {3,  "NPROD" },
                       {15, "Payment" },
                       {9,  "EndReceipt" },
                       {24, "VoidLast" },
                       {25, "VoidReceipt" },
                       {33, "InOut" },
                       {10, "BegDoc" },
                       {12, "EndDoc" },
                       {11, "TextReceipt" },
                       {43, "TextReceiptEx" },
                       {16, "PrintReport" },
                       {18, "OpenShift" },
                       {34, "PrintFiscReport" },
                       {38, "ReceiptCopy" },
                       {54, "PrintGoodsReport" },
                       {40, "SetTime" },
                       {4,  "ProgTime" },
                       {49, "GetDaySum" },
                       {99, "GetStatusEx" }
                   };
        #endregion

        #region Список ошибок
        public static Dictionary<UInt32, string> DeviceErrors =
                    new Dictionary<UInt32, string>()
                    {
                        {0, "Ok"},
                        {1, "Невірний SYNC пакету даних"},
                        {2, "Невірна CRC пакету від РРО"},
                        {3, "Помилка під'єднання"},
                        {4, "Вийшов час передачі команди"},
                        {5, "Помилка відправки заголовку пакету"},
                        {6, "Помилка відправки пакету даних"},
                        {7, "Помилка відправки CRC"},
                        {8, "Вийшов час очікування відповіді"},
                        {9, "Помилка приймання данних"},
                        {100, "Помилка MB SAM"},
                        {101, "Помилка CRC в записі фіскальної пам'яті"},
                        {102, "Невірна структура запису в фіскальній пам'яті"},
                        {103, "Звіт в фіскальній пам'яті не знайдено"},
                        {104, "Помилка вичитування заводського номеру"},
                        {105, "Внутрішня помилка"},
                        {106, "Помилка ЕКС: ЕКС не пуста і є пошкодженні пусті записи"},
                        {107, "Помилка ЕКС: Невірна довжина або контрольна сумма запису"},
                        {108, "Помилка ЕКС"},
                        {109, "Помилка ЕКС: ЕКС докінця не очищена"},
                        {110, "Помилка визначення FLASH пам'яті"},
                        {111, "Помилка стирання даних в AT25"},
                        {112, "Помилка запису даних в AT25"},
                        {113, "Помилка встановлення дати"},
                        {114, "Помилка встановлення часу"},
                        {115, "Фатальна помилка"},
                        {116, "Помилка ініціалізації годинника"},
                        {117, "Помилка годинника. Годинник не ініціалізований"},
                        {118, "Годинник не встановлено"},
                        {119, "Помилка довжини пакету"},
                        {120, "Помилка індикатора клієнта"},
                        {121, "Помилка в текстовій стрічці (Символ за діапазоном 0x20-0xff)"},
                        {122, "Невірний номер функції"},
                        {123, "Невірний номер операції"},
                        {124, "Невірна контрольна сума"},
                        {125, "Помилка команди, вийшов час очікування пакету"},
                        {126, "Помилка 24h"},
                        {127, "Помилка к-ті скидань оперативної пам'яті"},
                        {128, "Помилка заповнення фіскальної пам'яті(кінець)"},
                        {129, "Unused" },
                        {130, "Помилка uSD картки"},
                        {131, "Переповнення електронного журналу"},
                        {132, "Чек з таким глобальним номером вже існує"},
                        {133, "Сервісне блокування"},
                        {137, "Помилка аргументу"},
                        {200, "Змінено номер групи при продажі товару"},
                        {201, "Змінено назву проданого товару"},
                        {202, "Змінено номер ставки оподаткування при продажі товару"},
                        {203, "Змінено одиниці виміру проданого товару"},
                        {204, "Ціна товару не може бути нульовою"},
                        {205, "Кількість товару не може бути нульовою"},
                        {206, "Невірний ФН"},
                        {207, "Невірний ПН/ІН"},
                        {208, "Чек не відкрито"},
                        {209, "Переліміт суми чека"},
                        {210, "Невірний номер відділу"},
                        {211, "ЕЖ не обнулено"},
                        {212, "Невірний пароль"},
                        {213, "Такий код товару існує"},
                        {214, "Товар з таким кодом не знайдено"},
                        {215, "Відділ з таким номером не знайдено"},
                        {216, "Не запрограмовано закінчення чека"},
                        {217, "Форму оплати з таким номером не знайдено"},
                        {218, "Групу з таким номером не знайдено"},
                        {219, "Не запрограмовано заголовок чека"},
                        {220, "Запис ставок податку не знайдено"},
                        {221, "Оператора не знайдено"},
                        {222, "Номер оператора помилковий"},
                        {223, "Пароль оператора помилковий"},
                        {224, "Зміна не відкрита"},
                        {225, "Сума помилкова"},
                        {226, "Номер оператора помилковий"},
                        {227, "Дата помилкова"},
                        {228, "Фіскальний чек вже відкрито"},
                        {229, "Фіскальний чек не відкрито"},
                        {230, "Нефіскальний чек вже відкрито"},
                        {231, "Нефіскальний чек не відкрито"},
                        {232, "Номер форми оплати помилковий"},
                        {233, "Номер рядка закінчення помилковий"},
                        {234, "Номер групи помилковий"},
                        {235, "Номер рядка заголовка чека помилковий"},
                        {236, "Персоналізація не здійснена"},
                        {237, "Оплата за чеком відсутня"},
                        {238, "Оплата вже викликалась"},
                        {239, "Дані для програмування помилкові"},
                        {240, "Номер податку помилковий"},
                        {241, "Помилка роботи з таблицями, номер запису помилковий"},
                        {242, "Помилка роботи з таблицями, номер таблиці помилковий"},
                        {243, "Помилка роботи з таблицями, кількість записів помилкова"},
                        {244, "Помилка принтера"},
                        {245, "Параметри СОМ-порту помилкові"},
                        {246, "Параметри мережі помилкові"},
                        {247, "Перевищення максимальної к-ті"},
                        {248, "Ціна перевищує максимальну"},
                        {249, "Заборонений тип бінарного коментаря"},
                        {250, "Відсоток перевищує максимальне значення(99,99) або рівний 0"},
                        {251, "Заборонений запис знижки/націнки"},
                        {252, "Знижка на позицію вже існує"},
                        {253, "Запис на який надається знижка не знайдено"},
                        {254, "виконання функції заборонено"},
                        {255, "Чек з цим глобальним номером не знайдено"},
                        {256, "Чек анульовано (для копії чека)"},
                        {257, "Форма оплати не є готівковою"},
                        {258, "Грошей в сейфі не достатньо"},
                        {259, "Неможливо відмінити операцію"},
                        {260, "Обнулення вже виконано"},
                        {261, "Нефіскальний режим"},
                        {262, "Абсолютна знижка надто велика"},
                        {263, "Невірна команда"},
                        {264, "Немає записів для читання"},
                        {265, "Невірний порядок команд"},
                        {266, "Чек не відкрито"},
                        {267, "Сума повернення перевищує суму продажу"},
                        {268, "Код товару співпадає з кодом нафтопродукту"},
                        {269, "Не встановлено сервісну перемичку"},
                        {270, "Сума за зміну перевищує 9 999 999 99 коп"},
                        {271, "Форма оплати заборонена (або в цілому, або для даного типу операції)"},
                        {272, "Невірні дані для штрих-коду"},
                        {273, "Невірні тип для штрих-коду"},
                        {274, "Невірна контрольна сума штрих-коду"},
                        {275, "Невірний номер назви збору"},
                        {276, "Назву збору з таким номером не знайдено"},
                        {277, "Невірний номер рядка рекламної стрічки"},
                        {278, "Не запрограмовано рекламну стрічку"},
                        {279, "Завеликий логотип"},
                        {280, "Кількість продажу перевищує запрограмовану"},
                        {281, "Немає продажу для виклику оплати"},
                        {282, "Невірний номер звіту"},
                        {283, "Були продажі такого товару"},
                        {284, "Невірна ціна для акцизного збору"},
                        {285, "Відсутні додаткові данні"},
                        {286, "Друк відкладених звітів вже виконано"},
                        {400, "Помилка створення сокета"},
                        {401, "Помилка відкриття сокета"},
                        {402, "Помилка прийому даних сокета"},
                        {403, "Помилка передачі даних сокета"},
                        {404, "Помилка, порожня телеграма"},
                        {405, "Помилка розбору вкладених телеграм"},
                        {406, "Помилка розбору вкладених телеграм"},
                        {407, "Помилка, не вірна довжина або версія телеграми"},
                        {408, "Помилка, не вірні прапорці телеграми"},
                        {409, "Помилка, не вірний ідентифікатор телеграми"},
                        {410, "Персоналізація успішна"},
                        {411, "Повторити телеграму"},
                        {412, "Невірний формат телеграми"},
                        {413, "Блокування 72 години"},
                        {414, "Помилка верифікації документа"},
                        {415, "Документи до передачі відсутні"},
                        {416, "Завелика кількість документів"},
                        {417, "Невизначено DNS адресу"},
                        {450, "Формування чека в процесі"},
                        {451, "Помилка формування XML"},
                        {452, "Помилка формуваня чека"},
                        {453, "Помилка формування Z-звіту"},
                        {500, "В резервуарі не запрограмоване пальне"},
                        {501, "Пальне з таким номером не знайдено"},
                        {502, "Пальне на цей кран ПРК не запрограмоване"},
                        {503, "ПРК з таким номером не знайдено"},
                        {504, "Невірний номер каналу"},
                        {505, "Невірний номер палива"},
                        {506, "Невірний номер крана ПРК"},
                        {507, "Невірний номер ПРК"},
                        {508, "Невірний номер резервуару(палива)"},
                        {509, "ПРК Зайнята, операція старту не можлива"},
                        {510, "ПРК стартована іншим типом операції (Техпролив, післяплата, переплата)"},
                        {511, "Не можна стартувати ПРК на післяплату/техпролив при відкритому чеку"},
                        {512, "Не можна завершувати операцію без її початку"},
                        {513, "Не коректний стан чека ПРК (Чек не в стані Prepare)"},
                        {514, "Не коректне значення об'єму"},
                        {515, "Немає що повертати, потрібна доплата"},
                        {516, "Потрібне повернення"},
                        {517, "Дозволена лише одна операція по пальному в чеку"},
                        {518, "ПРК активні, операція заборонена"},
                        {519, "Помилка конфігурації. В ПРК прописані неактивні канали"},
                        {520, "Помилка конфігурації. Є пальні, що не прописані до резервуарів (або нема запису резервуарів)."},
                        {521, "Помилка конфігурації. До крана ПРК прописаний резервуар без пального."},
                        {522, "Помилка конфігурації. Ціна пального не може бути нульова."},
                        {523, "Заборона перенесення залишків після проведених операцій по цьому резервуару"},
                        {524, "В каналі запрограмовано невірний тип протоколу ПРК"},
                        {525, "Не знайдено запису з початковими залишками пального"},
                        {526, "Перевищення кількості ПРК на одному каналі (6)"},
                        {600, "Неможливо виконати операцію"},
                        {601, "Система зайнята іншою командою"},
                        {602, "Відсутні операції для закриття дня (чи зміни)"},
                        {603, "Термінал не знайдено"},
                        {700, "A hard error occurred in the low level disk I/O layer"},
                        {701, "Assertion failed"},
                        {702, "The physical drive cannot work"},
                        {703, "Could not find the file"},
                        {704, "Could not find the path"},
                        {705, "The path name format is invalid"},
                        {706, "Access denied due to prohibited access or directory full"},
                        {707, "Access denied due to prohibited access"},
                        {708, "The file/directory object is invalid"},
                        {709, "The physical drive is write protected"},
                        {710, "The logical drive number is invalid"},
                        {711, "The volume has no work area"},
                        {712, "There is no valid FAT volume"},
                        {713, "The f_mkfs() aborted due to any parameter error"},
                        {714, "Could not get a grant to access the volume within defined period"},
                        {715, "The operation is rejected according to the file sharing policy"},
                        {716, "LFN working buffer could not be allocated"},
                        {717, "Number of open files > _FS_SHARE"},
                        {718, "Given parameter is invalid"},
                        {900, "Кількість не може бути дробовою"}
                    };
        #endregion

        #region Список статусов
        public static Dictionary<int, string> DeviceStatus =
                    new Dictionary<int, string>()
                    {
                        {0, "Ок"},
                        {1, "РРО заблокирован"},
                        {2, "Смена открыта" },
                        {3, "Есть незавершенные операции"},
                        {4, "Открыт фискальный чек"},
                        {5, "Открыт  не фискальный чек"},
                        {6, "Оператор зарегистрирован"},
                        {7, "РРО фискализирован"},
                        {8, "Бумага заканчивается"},
                        {9, "Бумага закончилась"},
                        {10, "Открыта крышка принтера"},
                        {11, "РРО занят выполнением предыдущей команды"}
                    };
        #endregion

        #region Расширеный список статусов
        public static Dictionary<int, string> DeviceExStatus =
                    new Dictionary<int, string>()
                    {
                        {0, "Ок"},
                        {1, "Помилка принтера"},
                        {2, "Помилка індикатора клієнта"},
                        {3, "Помилка модуля безпеки" },
                        {4, "Неправильна дата або помилка годинника"},
                        {5, "Помилка фіскальної пам'яті"},
                        {6, "Переповнення фіскальної пам'яті"},
                        {7, "Помилка карти памяті"},
                        {8, "Перевищення тривалості зміни"},
                        {9, "Блокування 72 години"},
                        {10, "Автономне меню"},
                        {11, "РРО в стані ініціалізації"},
                        {12, "Cервісне блокування"}
                    };
        #endregion

        #region Список методов оплаты
        public static Dictionary<int, string> PaymentTypeList =
                   new Dictionary<int, string>()
                   {
                        {1, "Cash"},
                        {2, "Cashless" }
                   };
        #endregion

        #region Движение средств
        public static Dictionary<int, string> MoneyMovementType =
                  new Dictionary<int, string>()
                  {
                       {1, "Оплата Готівка" },
                       {2, "Оплата Безготівкова" },
                       {3, "Службове внесення" },
                       {4, "Службове вилучення" }
                  };
        #endregion
    }
}
